### Report for suspension-service

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- suspension-service in modules/suspension-service
Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.59.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/aws v5.59.0...
- Installed hashicorp/aws v5.59.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (37 to add, 3 to change, 37 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sns_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:GetTopicAttributes",
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic",
              + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic",
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.sqs_suspensions_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_suspensions_ecs_task" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueue*",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-audit",
              + "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-observability",
              + (known after apply),
            ]
        }
    }

  # aws_ecs_service.ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "ecs-service" {
        id                                 = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:service/dev-suspension-service-ecs-cluster/dev-suspension-service"
        name                               = "dev-suspension-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:445" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service:445" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:task-definition/suspension-service" -> (known after apply)
      - container_definitions    = (sensitive value) -> null # forces replacement
      ~ id                       = "suspension-service" -> (known after apply)
      ~ revision                 = 445 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "suspension-service"
            "Environment" = "dev"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.suspension_service_sns will be updated in-place
  ~ resource "aws_iam_policy" "suspension_service_sns" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-suspension-service-sns"
        name             = "dev-suspension-service-sns"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sns:Publish",
                          - "sns:GetTopicAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
                          - "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.suspensions_processor_sqs will be updated in-place
  ~ resource "aws_iam_policy" "suspensions_processor_sqs" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/dev-suspension-service-sqs"
        name             = "dev-suspension-service-sqs"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueue*",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-suspensions",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-observability",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq-audit",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-dlq",
                          - "arn:aws:sqs:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.deny_http["active_suspensions"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-active-suspensions-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming"] will be destroyed
  # (because key ["arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming"] is not in for_each map)
  - resource "aws_sns_topic_policy" "deny_http" {
      - arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming" -> null
      - id     = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming" -> null
      - owner  = "[REDACTED_AWS_ACCOUNT_ID]" -> null
      - policy = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                          - "SNS:Receive",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming"
                      - Sid       = "__default_statement_ID"
                    },
                  - {
                      - Action    = "sns:Subscribe"
                      - Condition = {
                          - StringEquals = {
                              - "sns:Protocol" = "http"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming"
                      - Sid       = "DenyHTTPSubscription"
                    },
                  - {
                      - Action    = "SNS:Publish"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-repo-incoming"
                      - Sid       = "DenyHTTPPublish"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
    }

  # aws_sns_topic_policy.deny_http["deceased_patient"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-deceased-patient"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["event_out_of_order"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-event-out-of-order"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["invalid_suspension"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["invalid_suspension_audit_topic"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-invalid-suspension-audit-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["mof_not_updated"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-not-updated-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["mof_updated"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-mof-updated-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["not_suspended"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "[REDACTED_AWS_ACCOUNT_ID]"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "SNS:Subscribe"
                      + Condition = {
                          + StringEquals = {
                              + "sns:Protocol" = "http"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      + Sid       = "DenyHTTPSubscription"
                    },
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-suspension-service-not-suspended-sns-topic"
                      + Sid       = "DenyHTTPPublish"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_sns_topic_policy.deny_http["suspension_service_incoming"] will be created
  + resource "aws_sns_topic_policy" "deny_http" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.suspension-service.data.aws_iam_policy_document.repo_incoming_observability_topic_access_to_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repo_incoming_observability_topic_access_to_queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.suspension-service.data.aws_iam_policy_document.suspensions_sns_topic_access_to_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "suspensions_sns_topic_access_to_queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.suspension-service.aws_cloudwatch_metric_alarm.suspensions_queue_age_of_message will be created
  + resource "aws_cloudwatch_metric_alarm" "suspensions_queue_age_of_message" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ]
      + alarm_description                     = "Alarm to alert approximate time for message in the queue"
      + alarm_name                            = "dev-suspension-service-queue-age-of-message"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "dev-suspension-service-suspensions"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:dev-alarm-notifications-sns-topic",
        ]
      + period                                = 1800
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 86400
      + treat_missing_data                    = "missing"
    }

  # module.suspension-service.aws_iam_policy.ingestion_bucket_get_object_policy will be created
  + resource "aws_iam_policy" "ingestion_bucket_get_object_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-ehr-ingestion_get_object_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.suspension-service.aws_iam_policy.suspensions_queue_send_message_policy will be created
  + resource "aws_iam_policy" "suspensions_queue_send_message_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.suspension-service.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:Assum
(truncated - see workflow logs for full output)
```

</details>